# SpotLightDistribution Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpotLightDistribution Methods
SpotLightDistribution Class See Also
---
The SpotLightDistribution type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Creates a copy of the LightDistribution derived object.  (Inherited from LightDistribution.) |
| Dispose | (Inherited from LightDistribution.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
SpotLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace